DanielNg520/Lenslife/esp32/firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1 N16R8 (16 MB flash, 8 MB OPI PSRAM)
CONFIG_IDF_TARGET="esp32s3"

# NimBLE peripheral (not Bluedroid)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_CONTROLLER_ENABLED=y

# Flash / PSRAM (N16R8 module)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
